MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Deinitializes an ADC instance.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_DeInit(M4_ADC_TypeDef *ADCx)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        /* Set the value of all registers to the reset value. */
        /* Stop ADC conversion. */
        ADCx->STR = 0u;
        ADCx->CR0 = 0u;
        ADCx->CR1 = 0u;
        ADCx->TRGSR = 0u;
        ADCx->CHSELRA0 = 0u;
        ADCx->CHSELRB0 = 0u;
        ADCx->AVCHSELR0 = 0u;
        ADCx->AWDCHSR0 = 0u;
        ADCx->SSTR0 = (uint8_t)0x0B;
        ADCx->SSTR1 = (uint8_t)0x0B;
        ADCx->SSTR2 = (uint8_t)0x0B;
        ADCx->SSTR3 = (uint8_t)0x0B;
        ADCx->SSTR4 = (uint8_t)0x0B;
        ADCx->SSTR5 = (uint8_t)0x0B;
        ADCx->SSTR6 = (uint8_t)0x0B;
        ADCx->SSTR7 = (uint8_t)0x0B;
        ADCx->SSTR8 = (uint8_t)0x0B;
        ADCx->CHMUXR0 = (uint16_t)0x3210;
        ADCx->CHMUXR1 = (uint16_t)0x7654;
        ADCx->ISR = 0u;
        ADCx->ICR = (uint8_t)0x03;
        ADCx->AWDCR = 0u;
        ADCx->AWDDR0 = 0u;
        ADCx->AWDDR1 = 0u;
        ADCx->AWDCHSR0 = 0u;
        ADCx->AWDSR0 = 0u;

        if (M4_ADC1 == ADCx)
        {
            ADCx->CHSELRA1 = 0u;
            ADCx->CHSELRB1 = 0u;
            ADCx->AVCHSELR1 = 0u;
            ADCx->CHMUXR2 = (uint16_t)0xBA98;
            ADCx->CHMUXR3 = (uint16_t)0xFEDC;
            ADCx->SYNCCR = (uint16_t)0x0C00;
            ADCx->AWDCHSR1 = 0u;
            ADCx->AWDSR1 = 0u;
            ADCx->PGACR = 0u;
            ADCx->PGAGSR = 0u;
            ADCx->PGAINSR0 = 0u;
            ADCx->PGAINSR1 = 0u;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set scan mode.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param[in] enMode                   See @ref en_adc_scan_mode_t for details.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_SetScanMode(M4_ADC_TypeDef *ADCx, en_adc_scan_mode_t enMode)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_ADC_SCAN_MODE(enMode));

        ADCx->CR0_f.MS = enMode;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set trigger source.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] pstcTrgCfg              Pointer to ADC trigger source configuration structure.
 ** \arg u8Sequence                     The sequence which you want to set it's trigger source.
 ** \arg enTrgEnable                    Enable or disable trigger source.
 ** \arg enTrgSel                       The type of trigger source.
 ** \arg enInTrg0                       Event number @ref en_event_src_t.
 ** \arg enInTrg1                       Event number @ref en_event_src_t.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 ** \note Sequence A and Sequence B CAN NOT set the same trigger source.
 **
 ******************************************************************************/
en_result_t ADC_ConfigTriggerSrc(M4_ADC_TypeDef *ADCx,
                                 const stc_adc_trg_cfg_t *pstcTrgCfg)
{
    __IO uint32_t *io32AdcxTrgSelR0 = NULL;
    __IO uint32_t *io32AdcxTrgSelR1 = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != ADCx) &&
        (NULL != pstcTrgCfg) &&
        (pstcTrgCfg->u8Sequence <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_ADC_TRGSEL(pstcTrgCfg->enTrgSel));
        enRet = Ok;
#ifdef __DEBUG
        switch (pstcTrgCfg->enTrgSel)
        {
        case AdcTrgsel_ADTRGX:
            break;

        case AdcTrgsel_TRGX0:
            DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg0));
            break;

        case AdcTrgsel_TRGX1:
            DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg1));
            break;

        case AdcTrgsel_TRGX0_TRGX1:
            DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg0));
            DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg1));
            break;

        default:
            enRet = ErrorInvalidParameter;
            break;
        }
        if (Ok == enRet)
#endif /* #ifdef __DEBUG */
        {
            if (ADC_SEQ_A == pstcTrgCfg->u8Sequence)
            {
                ADCx->TRGSR_f.TRGSELA = pstcTrgCfg->enTrgSel;
            }
            else
            {
                ADCx->TRGSR_f.TRGSELB = pstcTrgCfg->enTrgSel;
            }

            if (AdcTrgsel_ADTRGX != pstcTrgCfg->enTrgSel)
            {
                if (M4_ADC1 == ADCx)
                {
                    io32AdcxTrgSelR0 = &(M4_AOS->ADC1_ITRGSELR0);
                    io32AdcxTrgSelR1 = &(M4_AOS->ADC1_ITRGSELR1);
                }
                else
                {
                    io32AdcxTrgSelR0 = &(M4_AOS->ADC2_ITRGSELR0);
                    io32AdcxTrgSelR1 = &(M4_AOS->ADC2_ITRGSELR1);
                }

