MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
                switch (pstcTrgCfg->enTrgSel)
                {
                case AdcTrgsel_TRGX0:
                    *io32AdcxTrgSelR0 = pstcTrgCfg->enInTrg0;
                    break;

                case AdcTrgsel_TRGX1:
                    *io32AdcxTrgSelR1 = pstcTrgCfg->enInTrg1;
                    break;

                case AdcTrgsel_TRGX0_TRGX1:
                    *io32AdcxTrgSelR0 = pstcTrgCfg->enInTrg0;
                    *io32AdcxTrgSelR1 = pstcTrgCfg->enInTrg1;
                    break;

                default:
                    enRet = ErrorInvalidParameter;
                    break;
                }
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set trigger source.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8Seq                   The sequence which you want to set it's trigger source.
 **
 ** \param [in] enState                 Enable or disable trigger source.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_TriggerSrcCmd(M4_ADC_TypeDef *ADCx,
                              uint8_t u8Seq,
                              en_functional_state_t enState)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != ADCx) && (u8Seq <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

        if (ADC_SEQ_A == u8Seq)
        {
            ADCx->TRGSR_f.TRGENA = enState;
        }
        else
        {
            ADCx->TRGSR_f.TRGENB = enState;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Add ADC channel.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] pstcChCfg               Pointer to ADC channel configuration structure.
 ** \arg u32Channel                     The channel(s) you want to configure.
 ** \arg u8Sequence                     The sequence which the channel(s) belong(s) to.
 ** \arg pu8SampTime                    Pointer to sampling time.
 **                                     eg. u32Channel = 1001b
 **                                     pu8SampTime[0] = channel 0's time
 **                                     pu8SampTime[1] = channel 3's time
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 ** \note Sequence A and Sequence B CAN NOT set the same channel!!!
 **
 ******************************************************************************/
en_result_t ADC_AddAdcChannel(M4_ADC_TypeDef *ADCx, const stc_adc_ch_cfg_t *pstcChCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t i;
    uint8_t j;
    uint32_t u32ChannelSel;
    __IO uint8_t *io8Sstr;

    if ((NULL != ADCx) &&
        (NULL != pstcChCfg) &&
        (pstcChCfg->u8Sequence <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            u32ChannelSel = pstcChCfg->u32Channel & ADC1_CH_ALL;
            if (ADC_SEQ_A == pstcChCfg->u8Sequence)
            {
                ADCx->CHSELRA0 |= (uint16_t)u32ChannelSel;
                ADCx->CHSELRA1 |= (uint16_t)(u32ChannelSel >> 16u);
            }
            else
            {
                ADCx->CHSELRB0 |= (uint16_t)u32ChannelSel;
                ADCx->CHSELRB1 |= (uint16_t)(u32ChannelSel >> 16u);
            }
        }
        else
        {
            u32ChannelSel = pstcChCfg->u32Channel & ADC2_CH_ALL;
            if (ADC_SEQ_A == pstcChCfg->u8Sequence)
            {
                ADCx->CHSELRA0 |= (uint16_t)u32ChannelSel;
            }
            else
            {
                ADCx->CHSELRB0 |= (uint16_t)u32ChannelSel;
            }
        }

        /* Set sampling time */
        i = 0u;
        j = 0u;
        io8Sstr = &(ADCx->SSTR0);
        while (0u != u32ChannelSel)
        {
            if (u32ChannelSel & 0x1ul)
            {
                io8Sstr[i] = pstcChCfg->pu8SampTime[j++];
            }
            u32ChannelSel >>= 1u;
            i++;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Delete ADC channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] pstcChCfg               Pointer to ADC channel configuration structure.
 ** \arg u32Channel                     The channel(s) you want to delete.
 ** \arg u8Sequence                     (Ignore)
 ** \arg pu8SampTime                    (Ignore)
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               You can use this function to delete ADC channel(s)
 **                                     and then set the corresponding pin(s) of the channel(s)
 **                                     to the other mode you need in your application.
 **
 ******************************************************************************/
en_result_t ADC_DelAdcChannel(M4_ADC_TypeDef *ADCx, const stc_adc_ch_cfg_t *pstcChCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16ChSelR0;
    uint16_t u16ChSelR1;

    if ((NULL != ADCx) &&
        (NULL != pstcChCfg) &&
        (pstcChCfg->u8Sequence <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        u16ChSelR0 = (uint16_t)(pstcChCfg->u32Channel);
        u16ChSelR1 = (uint16_t)(pstcChCfg->u32Channel >> 16u);

        ADCx->CHSELRA0 &= (uint16_t)(~u16ChSelR0);
        ADCx->CHSELRB0 &= (uint16_t)(~u16ChSelR0);

        if (M4_ADC1 == ADCx)
        {
            ADCx->CHSELRA1 &= (uint16_t)(~u16ChSelR1);
            ADCx->CHSELRB1 &= (uint16_t)(~u16ChSelR1);
        }

