MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable ADC AWD(analog watch dog).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] enState                 Enable or disable AWD.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_AwdCmd(M4_ADC_TypeDef *ADCx, en_functional_state_t enState)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

        ADCx->AWDCR_f.AWDEN = enState;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable ADC AWD(analog watch dog) interrupt.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] enState                 Enable or disable AWD interrupt.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_AwdITCmd(M4_ADC_TypeDef *ADCx, en_functional_state_t enState)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

        ADCx->AWDCR_f.AWDIEN = enState;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Add AWD channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32Channel              The channel(s), which will be set as AWD channel(s).
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               The channel must first be configured as an analog channel
 **                                     by function ADC_AddAdcChannel.
 **
 ******************************************************************************/
en_result_t ADC_AddAwdChannel(M4_ADC_TypeDef *ADCx, uint32_t u32Channel)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16ChSelR0;
    uint16_t u16ChSelR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            u32Channel &= ADC1_CH_ALL;
        }
        else
        {
            u32Channel &= ADC2_CH_ALL;
        }

        u16ChSelR0 = (uint16_t)u32Channel;
        u16ChSelR1 = (uint16_t)(u32Channel >> 16u);

        ADCx->AWDCHSR0 |= u16ChSelR0;
        if (M4_ADC1 == ADCx)
        {
            ADCx->AWDCHSR1 |= u16ChSelR1;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Delete AWD channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32Channel              The AWD channel(s) which you are going to delete.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_DelAwdChannel(M4_ADC_TypeDef *ADCx, uint32_t u32Channel)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16ChSelR0;
    uint16_t u16ChSelR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        u16ChSelR0 = (uint16_t)u32Channel;
        u16ChSelR1 = (uint16_t)(u32Channel >> 16u);

        ADCx->AWDCHSR0 &= (uint16_t)(~u16ChSelR0);
        if (M4_ADC1 == ADCx)
        {
            ADCx->AWDCHSR1 &= (uint16_t)(~u16ChSelR1);
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief ADC programmable gain amplifier(PGA) configuration.
 **
 ** \param [in] enFactor                PGA gain factor.
 ** \param [in] enNegativeIn            PGA negative input select.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               Only ADC1 has PGA.
 **
 ******************************************************************************/
void ADC_ConfigPga(en_adc_pga_factor_t enFactor, en_adc_pga_negative_t enNegativeIn)
{
    DDL_ASSERT(IS_ADC_PGA_FACTOR(enFactor));
    DDL_ASSERT(IS_ADC_PGA_NEGATIVE(enNegativeIn));

    M4_ADC1->PGAGSR_f.GAIN = enFactor;
    M4_ADC1->PGAINSR1_f.PGAVSSEN = enNegativeIn;
}

/**
 *******************************************************************************
 ** \brief Enable or disable PGA.
 **
 ** \param [in] enState                 Enable or disable PGA.
 **
 ** \retval None.
 **
 ******************************************************************************/
void ADC_PgaCmd(en_functional_state_t enState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    if (Enable == enState)
    {
        M4_ADC1->PGACR_f.PGACTL = AdcPgaCtl_Amplify;
    }
    else
    {
        M4_ADC1->PGACR_f.PGACTL = AdcPgaCtl_Invalid;
    }
}

/**
 *******************************************************************************
 ** \brief Add PGA channel(s).
 **
 ** \param[in] u32Channel               The channel(s), which you want to gain.
 **
 ** \retval None.
 **
 ** \note                               Only ADC1 has PGA. The channel must first
 **                                     be configured as an analog channel
 **                                     by function ADC_AddAdcChannel
 **
 ******************************************************************************/
void ADC_AddPgaChannel(uint32_t u32Channel)
{
    M4_ADC1->PGAINSR0 |= ((uint16_t)(u32Channel & PGA_CH_ALL));
}

/**
 *******************************************************************************
 ** \brief Delete PGA channel(s).
 **
 ** \param[in] u32Channel               The PGA channel(s) which will be deleted.
 **
 ** \retval None.
 **
 ******************************************************************************/
void ADC_DelPgaChannel(uint32_t u32Channel)
{
    M4_ADC1->PGAINSR0 &= (uint16_t)(~u32Channel);
}

/**
 *******************************************************************************
 ** \brief ADC sync mode configuration.
 **
 ** \param [in] enMode                  Synchronous mode types.
 ** \param [in] u8TrgDelay              ADC2 trigger delay time.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
void ADC_ConfigSync(en_adc_sync_mode_t enMode, uint8_t u8TrgDelay)
{
    DDL_ASSERT(IS_ADC_SYNC_MODE(enMode));

    /* Disable synchronous mode first. */
    M4_ADC1->SYNCCR_f.SYNCEN = AdcSync_Disable;

