MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
    M4_ADC1->SYNCCR_f.SYNCMD = enMode;
    M4_ADC1->SYNCCR_f.SYNCDLY = u8TrgDelay;
}

/**
 *******************************************************************************
 ** \brief Enable or disable sync mode.
 **
 ** \param [in] enState                 Enable or disable sync mode.
 **
 ** \retval None.
 **
 ******************************************************************************/
void ADC_SyncCmd(en_functional_state_t enState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    M4_ADC1->SYNCCR_f.SYNCEN = enState;
}

/**
 *******************************************************************************
 ** \brief Start an ADC conversion.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               Software startup only support sequence A.
 **
 ******************************************************************************/
en_result_t ADC_StartConvert(M4_ADC_TypeDef *ADCx)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        ADCx->STR = 1u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Stop an ADC conversion and clear flags.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval ErrorTimeout                Timeout.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_StopConvert(M4_ADC_TypeDef *ADCx)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint32_t u32TimeCount = 0u;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        enRet = Ok;
        /* Make sure the ADC is really stopped. */
        while (ADCx->STR == 1u)
        {
            /* Stop ADC conversion. */
            ADCx->STR = 0u;
            if (++u32TimeCount > 10000u)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get the conversion status flag.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8Seq                   The sequence which you want to get.
 **                                     it's conversion status flag.
 **
 ** \retval Set                         ADC converted done.
 ** \retval Reset                       ADC is converting or parameter error.
 **
 ******************************************************************************/
en_flag_status_t ADC_GetEocFlag(const M4_ADC_TypeDef *ADCx, uint8_t u8Seq)
{
    en_flag_status_t enFlag = Reset;

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));

    if (ADCx->ISR & ((uint8_t)(0x1ul << u8Seq)))
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 *******************************************************************************
 ** \brief Clear conversion status flag of sequence A or sequence B.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8Seq                   The sequence which you want to clear
 **                                     it's conversion status flag.
 **
 ** \retval None.
 **
 ******************************************************************************/
void ADC_ClrEocFlag(M4_ADC_TypeDef *ADCx, uint8_t u8Seq)
{
    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        ADCx->ISR &= (uint8_t)(~(0x1ul << u8Seq));
    }
}

/**
 *******************************************************************************
 ** \brief ADC start sequence A, check it's EOC status and get the data.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [out] pu16AdcData            The address to store ADC value.
 **                                     The location of the data store depends on
 **                                     the parameter u8Length.
 **                                     u8Length >= ADCx_CH_COUNT(ADC1_CH_COUNT or ADC2_CH_COUNT),
 **                                     all of the ADC data regs will be read:
 **                                     pu16AdcData[0] = data of Channel 0,
 **                                     pu16AdcData[1] = data of Channel 1,
 **                                     pu16AdcData[2] = data of Channel 2,
 **                                                 ...
 **                                     u8Length < ADCx_CH_COUNT(ADC1_CH_COUNT or ADC2_CH_COUNT),
 **                                     only the data of the enabled channles will be read:
 **                                     pu16AdcData[0] = data of the 1st enabled channel,
 **                                     pu16AdcData[1] = data of the 2nd enabled channel,
 **                                     pu16AdcData[2] = data of the 3rd enabled channel,
 **                                                 ...
 **
 ** \param [in] u8Length                The length of the ADC data to be read.
 **
 ** \param [in] u32Timeout              Timeout(millisecond).
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval ErrorTimeout                Timeout.
 ** \retval OperationInProgress         ADC is converting.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_PollingSa(M4_ADC_TypeDef *ADCx,
                          uint16_t *pu16AdcData,
                          uint8_t u8Length,
                          uint32_t u32Timeout)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t u8AllDataLength = 0u;
    uint32_t u32Channel = 0u;
    uint32_t u32AdcTimeout = 0u;
    __IO uint32_t u32TimeCount = 0u;

    if ((NULL != ADCx) && (NULL != pu16AdcData) && (0u != u8Length))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            if (u8Length >= ADC1_CH_COUNT)
            {
                u8AllDataLength = ADC1_CH_COUNT;
            }
            else
            {
                u32Channel = (uint32_t)ADCx->CHSELRA1;
                u32Channel <<= 16u;
                u32Channel |= (uint32_t)ADCx->CHSELRA0;
            }
        }
        else
        {
            if (u8Length >= ADC2_CH_COUNT)
            {
                u8AllDataLength = ADC2_CH_COUNT;
            }
            else
            {
                u32Channel = (uint32_t)M4_ADC1->CHSELRA0;
            }
        }

        /* Start ADC conversion. */
        ADCx->STR = (uint8_t)0x01;

