MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
        /* 10 is the number of required instructions cycles for the below loop statement. */
        u32AdcTimeout = u32Timeout * (SystemCoreClock / 10u / 1000u);
        u32TimeCount = 0u;
        enRet = ErrorTimeout;
        while (u32TimeCount < u32AdcTimeout)
        {
            if (bM4_ADC1_ISR_EOCAF)
            {
                /* Get ADC data. */
                if (u8AllDataLength)
                {
                    ADC_ReadAllData(ADCx, pu16AdcData, u8AllDataLength);
                }
                else
                {
                    ADC_GetChData(ADCx, u32Channel, pu16AdcData, u8Length);
                }

                /* Clear sequence A flag. */
                bM4_ADC1_ISR_EOCAF = 0u;
                enRet = Ok;
                break;
            }
            u32TimeCount++;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Reading all data regs of an ADC.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [out] pu16AdcData            The address where the data will be stored.
 **                                     pu16AdcData[0] = data of Channel 0,
 **                                     pu16AdcData[1] = data of Channel 1,
 **                                     pu16AdcData[2] = data of Channel 2,
 **                                                 ...
 **
 ** \param [in] u8Length                The length of the ADC data to be read.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_GetAllData(const M4_ADC_TypeDef *ADCx, uint16_t *pu16AdcData, uint8_t u8Length)
{
    en_result_t enRet = ErrorInvalidParameter;

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));
    if (((M4_ADC1 == ADCx) && (u8Length >= ADC1_CH_COUNT)) ||
        ((M4_ADC2 == ADCx) && (u8Length >= ADC2_CH_COUNT)))
    {
        ADC_ReadAllData(ADCx, pu16AdcData, u8Length);
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Reading the data of the specified channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base
 ** \arg M4_ADC1                        ADC unit 1 instance register base
 ** \arg M4_ADC2                        ADC unit 2 instance register base
 **
 ** \param [in] u32TargetCh             The specified channel(s)
 **
 ** \param [out] pu16AdcData            The address where the data will be stored.
 **                                     pu16AdcData[0] = data of the 1st enabled channel,
 **                                     pu16AdcData[1] = data of the 2nd enabled channel,
 **                                     pu16AdcData[2] = data of the 3rd enabled channel,
 **                                     eg. u32TargetCh = 1001b
 **                                     pu16AdcData[0] = Channel 0's data,
 **                                     pu16AdcData[1] = Channel 3's data,
 **
 ** \param [in] u8Length                The length of the ADC data to be read.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_GetChData(const M4_ADC_TypeDef *ADCx,
                          uint32_t u32TargetCh,
                          uint16_t *pu16AdcData,
                          uint8_t u8Length)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t i;
    uint8_t j;
    uint32_t u32Channel;
    __IO const uint16_t *pu16DataReg = &(ADCx->DR0);

    if ((NULL != ADCx) && (NULL != pu16AdcData) && (0u != u8Length))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            u32Channel = u32TargetCh & ADC1_CH_ALL;
        }
        else
        {
            u32Channel = u32TargetCh & ADC2_CH_ALL;
        }

        i = 0u;
        j = 0u;
        while ((0u != u32Channel) && (0u != u8Length))
        {
            if (0u != (u32Channel & 0x1ul))
            {
                pu16AdcData[j] = pu16DataReg[i];
                j++;
                u8Length--;
            }

            u32Channel >>= 1u;
            i++;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get the value of a specified channel via channel index.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base
 ** \arg M4_ADC1                        ADC unit 1 instance register base
 ** \arg M4_ADC2                        ADC unit 2 instance register base
 **
 ** \param [in] u8ChIndex               The index of the specified channel.
 **                                     u8ChIndex < ADC1_CH_COUNT while ADCx == M4_ADC1;
 **                                     u8ChIndex < ADC2_CH_COUNT while ADCx == M4_ADC2.
 **
 ** \retval An uint16_t value -- the ADC value of the specified channel.
 **
 ******************************************************************************/
uint16_t ADC_GetValue(const M4_ADC_TypeDef *ADCx, uint8_t u8ChIndex)
{
    __IO const uint16_t *pu16DataReg = &(ADCx->DR0);

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));

    return pu16DataReg[u8ChIndex];
}

/**
 *******************************************************************************
 ** \brief Get all AWD channels status flags.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \retval u32AwdFlag                  0  -- No ADC channel meets AWD comparison conditions.
 **                                     !0 -- The bit value of the channel that satisfies the
 **                                           AWD condition is 1.
 **
 ******************************************************************************/
uint32_t ADC_GetAwdFlag(const M4_ADC_TypeDef *ADCx)
{
    uint32_t u32AwdFlag;

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));

    if (M4_ADC1 == ADCx)
    {
        u32AwdFlag = ADCx->AWDSR1;
        u32AwdFlag <<= 16u;
        u32AwdFlag |= ADCx->AWDSR0;
    }
    else
    {
        u32AwdFlag = ADCx->AWDSR0;
    }

    return u32AwdFlag;
}

/**
 *******************************************************************************
 ** \brief Clear all AWD channels status flags
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ******************************************************************************/
void ADC_ClrAwdFlag(M4_ADC_TypeDef *ADCx)
{
    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

