MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_adc.c
        ADCx->AWDSR0 = 0u;
        if (M4_ADC1 == ADCx)
        {
            ADCx->AWDSR0 = 0u;
            ADCx->AWDSR1 = 0u;
        }
    }
}

/**
 *******************************************************************************
 ** \brief Clear AWD specified channels status flags.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32AwdCh                The channel(s) which you want to clear it's flag(s).
 **
 **
 ******************************************************************************/
void ADC_ClrAwdChFlag(M4_ADC_TypeDef *ADCx, uint32_t u32AwdCh)
{
    uint16_t u16ChR0;
    uint16_t u16ChR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        u16ChR0 = (uint16_t)u32AwdCh;
        u16ChR1 = (uint16_t)(u32AwdCh >> 16u);

        ADCx->AWDSR0 &= (uint16_t)(~u16ChR0);
        if (M4_ADC1 == ADCx)
        {
            ADCx->AWDSR1 &= (uint16_t)(~u16ChR1);
        }
    }
}

/**
 *******************************************************************************
 ** \brief Remap an ADC pin to channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32DestChannel          Destination channel(s).
 **
 ** \param [in] u8AdcPin                ADC pin number.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_ChannleRemap(M4_ADC_TypeDef *ADCx,
                             uint32_t u32DestChannel,
                             uint8_t u8AdcPin)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t i;
    uint8_t u8OffsetReg;
    uint8_t u8ChPos;
    uint16_t u16AdcPin = u8AdcPin;
    __IO uint16_t *io16Chmuxr = NULL;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        enRet = Ok;
        if (M4_ADC1 == ADCx)
        {
            if (u16AdcPin <= ADC1_IN15)
            {
                u32DestChannel &= ADC1_PIN_MASK_ALL;
            }
            else
            {
                enRet = ErrorInvalidParameter;
            }
        }
        else
        {
            if ((u16AdcPin > ADC12_IN4) && (u16AdcPin < ADC12_IN11))
            {
                u16AdcPin -= 4u;
                u32DestChannel &= ADC2_PIN_MASK_ALL;
            }
            else
            {
                enRet = ErrorInvalidParameter;
            }
        }

        if (Ok == enRet)
        {
            i = 0u;
            while (0u != u32DestChannel)
            {
                if (u32DestChannel & 0x1ul)
                {
                    u8OffsetReg = i / 4u;
                    u8ChPos = (i % 4u) * 4u;
                    io16Chmuxr = &(ADCx->CHMUXR0) + u8OffsetReg;
                    *io16Chmuxr &= (uint16_t)(~(0xFul << u8ChPos));
                    *io16Chmuxr |= (uint16_t)(u16AdcPin << u8ChPos);
                }

                u32DestChannel >>= 1u;
                i++;
            }
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get the number of the pin corresponding to the specified channel.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8ChIndex               This channel that you want to get its pin number.
 **
 ** \retval [0, 15]                     The correct ADC pin number.
 ** \retval [0xFF]                      The invalid ADC pin number.
 **
 ******************************************************************************/
uint8_t ADC_GetChannelPinNum(const M4_ADC_TypeDef *ADCx, uint8_t u8ChIndex)
{
    uint8_t u8OffsetPin;
    uint8_t u8OffsetReg;
    uint8_t u8ChPos;
    uint8_t u8AdcPin = ADC_PIN_INVALID;
    __IO const uint16_t *io16Chmuxr = NULL;

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));

    if (M4_ADC1 == ADCx)
    {
        DDL_ASSERT(IS_ADC1_CH_INDEX(u8ChIndex));
        u8OffsetPin = 0u;
    }
    else
    {
        DDL_ASSERT(IS_ADC2_CH_INDEX(u8ChIndex));
        u8OffsetPin = 4u;
    }

    u8OffsetReg = u8ChIndex / 4u;
    u8ChPos = (u8ChIndex % 4u) * 4u;
    io16Chmuxr = &(ADCx->CHMUXR0) + u8OffsetReg;
    u8AdcPin = (uint8_t)((*io16Chmuxr >> u8ChPos) & ((uint16_t)0xF));
    u8AdcPin += u8OffsetPin;

    return u8AdcPin;
}

/*******************************************************************************
 * Function implementation - local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief Read all data of an ADC. pu16AdcData[0] = DR0, pu16AdcData[1] = DR1, ...
 **
 ******************************************************************************/
static void ADC_ReadAllData(const M4_ADC_TypeDef *ADCx, uint16_t *pu16AdcData, uint8_t u8Length)
{
    uint8_t i;
    __IO const uint16_t *pu16DataReg = &(ADCx->DR0);

    for (i = 0u; i < u8Length; i++)
    {
        pu16AdcData[i] = pu16DataReg[i];
    }
}

//@} // AdcGroup

#endif /* DDL_ADC_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
